app/views/employees/index.html.erb

SELECT "employees".* FROM "employees" WHERE (manager_id is null)
---
<%@employees.each do |i|%>
<%if !i.employee_list.blank?%>