app/controllers/articles_controller.rb

INSERT INTO "articles" ("author_name", "content", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @article = Article.new(params[:article])
    if @article.save