app/controllers/employees_controller.rb

SELECT "employees".* FROM "employees" WHERE (manager_id is null)
SELECT "employees".* FROM "employees" WHERE "employees"."manager_id" = 1
---
  def index
    @employees = Employee.all
    @employee_list = Employee.where("manager_id is null")

SELECT "employees".* FROM "employees" WHERE (name like '%name')
---
  def employee_autocomplete
    employee = Employee.where("name like '#{params[:term]}%'")

SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @employee = Employee.find(params[:id])

SELECT "employees".* FROM "employees" WHERE (name != 'CEO' and manager_id is null)
---
  def new
    @employees = Employee.where("name != 'CEO' and manager_id is null")

SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT 1  [["id", "13"]]
---
  def edit
    @employee = Employee.find(params[:id])

SELECT "employees".* FROM "employees" WHERE "employees"."name" = 'Employee5' LIMIT 1
INSERT INTO "employees" ("created_at", "manager_id", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 27 Mar 2014 08:49:17 UTC +00:00], ["manager_id", nil], ["name", "CEO"], ["updated_at", Thu, 27 Mar 2014 08:49:17 UTC +00:00]]
---
  def create
    @employee = Employee.new(params[:employee])
    @employee.manager_id = Employee.find_by_name(params[:employee][:manager_id]).id
    respond_to do |format|
      if @employee.save

SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT 1  [["id", "14"]]
SELECT "employees".* FROM "employees" WHERE "employees"."name" = 'Employee1' LIMIT 1
UPDATE "employees" SET "manager_id" = 0, "updated_at" = '2014-04-01 18:01:00.994609' WHERE "employees"."id" = 14
---
  def update
    @employee = Employee.find(params[:id])

    respond_to do |format|
	params[:employee][:manager_id] = Employee.find_by_name(params[:employee][:manager_id]).id
      if @employee.update_attributes(params[:employee])

SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "employees" WHERE "employees"."id" = ?  [["id", 3]]
---
  def destroy
    @employee = Employee.find(params[:id])
    @employee.destroy